       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPORT-TOTALS.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM READ-INPUT.
           PERFORM PRINT-TOTAL.
           STOP RUN.
       READ-INPUT.
           DISPLAY "reading".
       PRINT-TOTAL.
           DISPLAY "total".
